*** #+NAME: Non-Session Test
   #+begin_src ccalc :results output :query 1
     :- macros
        n -> 10.

     :- constants
        c :: inertialFluent(0..n);
        a ,
        b :: exogenousAction.

     :- variables
        I :: 0..n-1.

     a causes c=I+1 if c=I.
     b causes c=I+2 if c=I, I+2 < n.

     nonexecutable a if c >= n.
     nonexecutable b if c >= n-2.

     :- query          % prediction
        label :: 1;
        maxstep :: 2;
        0: c=5;
        0: a;
        1: a.

     :- query          % postdiction
        label :: 2;
        maxstep :: 2;
        maxstep: c=5;
        0: a;
        1: a.

     :- query          % planning
        label :: 3;
        maxstep :: 0..infinity;
        0: c=4;
        maxstep: c=10.
   #+end_src

   #+RESULTS:
   #+begin_example
   FALLBACK: 0



   Causal Calculator: Version 2.0.
   Type 'help.' for online help.


   % loading file /Volumes/documents/github/otherlibs/ccalc/macros.std
   % loading file /var/folders/gs/z_hwqrp941339_6ztds0h45c0000gn/T/babel-7DJl0a/ccalc-Gjcsss.pl
   % in transition mode...
   % 24 atoms, 48 rules, 149 clauses (28 new atoms)
   % Grounding time: 0.02 seconds
   % Completion time: 0.01 seconds
   % Total time: 0.03 seconds
   % Shifting atoms and clauses... done. (0.00 seconds)
   % After shifting: 83 atoms (including new atoms), 257 clauses
   % Writing input clauses... done.  (0.00 seconds)
   % Calling relsat 2.0... done.
   % Reading output file(s) from SAT solver... done.
   % Solution time: 0 seconds (prep 0 seconds, search 0 seconds)

   0:  c=5

   ACTIONS:  a

   1:  c=6

   ACTIONS:  a

   2:  c=7


   #+end_example


